Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: discuss how animals and plants are interdependent upon each other plants produce food and oxygen for animals while animals when they die decay replacing nutrients in the soil for plants and releasing carbon into the air to continue the carbon cycle .
af: bespreek hoe plante en diere van mekaar afhanklik is plante produseer voedsel en suurstof vir diere terwyl diere wanneer hulle doodgaan ontbind en daardeur minerale voedingstowwe wat plante kan gebruik in die grond terugplaas terwyl koolstofdioksied in die lug vrygestel word om die koolstofkringloop te laat voortgaan .

source: green plants are just like factories !
af: groen plante is net soos fabrieke !

source: they make food for themselves and every animal on earth using sunlight energy water and the gas carbon dioxide .
af: hulle maak voedsel vir hulself en vir elke dier op aarde deur sonligenergie water en die gaskoolstofdioksied te gebruik .

source: they also recycle the air and make oxygen for us to breathe .
af: hulle hersirkuleer die lug en maak suurstof sodat ons kan asemhaal .

source: scientists have found out exactly how plants are able to do all all these things .
af: wetenskaplikes het uitgevind presies hoe plante in staat is om al hierdie dinge te doen .

source: let's take a closer look at how scientists did this and see how plants make food for themselves and us .
af: kom ons kyk van naderby hoe wetenskaplikes dit uitgevind het en hoe plante vir hulself en vir ons kos maak .

source: what happens in a factory ?
af: wat gebeur in 'n fabriek ?

source: why do you think we can say plants are like factories ?
af: waarom dink jy kan ons s plante is soos fabrieke ?

source: a factory is a place where goods or products are made assembled manufactured and then delivered to other places to be used .
af: 'n fabriek is 'n plek waar goedere of produkte gemaak aanmekaargesit geproduseer word en dan word dit aan ander plekke afgelewer om gebruik te word .

source: plants are therefore like factories as they use raw products to make new products food .
af: plante werk dus soos fabrieke wanneer hulle rou produkte gebruik om nuwe produkte te maak voedsel en suurstof .

source: plants make food for themselves and plants are the beginning of the food chain therefore all other animals whether herbivores which eat plants directly or carnivores which eat the herbivores depend on plants for food .
af: plante produseer voedsel vir hulself en is daarom die begin van die voedselketting .

source: the word photosynthesis is actually has two parts photo light and synthesis to make or put together .
af: die woord fotosintese bestaan eintlik uit twee dele foto lig en sintese om te maak of bymekaar te voeg .

source: so it means to use light to make something in this case food .
af: dit beteken dus om lig te gebruik om iets te maak in hierdiegeval voedsel .

source: photosynthesis is the process that plants use to change the energy from sunlight into energy for food .
af: fotosintese is die proses wat plante gebruik om die energie van sonlig te verander in voedselenergie .

source: plants change light energy from the sun into food energy .
af: plante verander ligenergie van die son in voedselenergie .

source: photosynthesis happens in all green parts of a plant .
af: fotosintese vind plaas in alle groen dele van 'n plant .

source: leaves are usually the greenest parts .
af: blare is gewoonlik die groenste dele van 'n plant .

source: so plants do this mostly in their leaves .
af: plante doen dit dus meestal in hulle blare .

source: there are some important requirements for photosynthesis to happen
af: daar is 'n paar belangrike vereistes vir fotosintese om te kan plaasvind

source: chlorophyll chlorophyll is a green substance that plants use to capture light energy from the sun .
af: chlorofil chlorofil is 'n groen stof wat plante gebruik om ligenergie van die son vas te vang .

source: chlorophyll is very important .
af: chlorofil is baie belangrik .

source: without chlorophyll plants cannot use the sunlight energy to make food .
af: daarsonder kan plante nie sonligenergie gebruik om voedsel te maak nie .

source: also oxygen levels in the air will go down .
af: suurstofvlakke in die lug sal ook daal .

source: if that happens plants and animals will suffocate .
af: indien dit gebeur sal plante en diere versmoor .

source: as a fun activity take learners outside to see if there are other colours found in leaves and not just the green pigment chlorophyll .
af: vir 'n prettige aktiwiteit neem die leerders buitentoe om te kyk of daar enige ander kleure as die groen pigment chlorofil in blare gevind kan word .

source: although green chlorophyll is predominant there are also yellow orange and purple pigments found in leaves especially in autumn when the leaves change colour .
af: alhoewel groen chlorofil oorheersend is is daar ook geel oranje en pers pigmente in blare te vinde veral in die winter wanneer die blare van kleur verander .

source: in the body the pigment melanin is the main determinant of skin colour and it is also found in hair and the iris in the eye .
af: in ons liggame bepaal die hoeveelheid van die pigment melanien hoofsaaklik ons velkleur en dit word ook gevind in hare en in die iris van die oog .

source: sunlight sunlight has energy .
af: sonlig sonlig bevat energie .

source: plants use this energy to make sugars from water and carbon dioxide .
af: plante gebruik hierdie energie om suikers te vervaardig deur water en koolstofdioksied te kombineer .

source: scientists have a term for substances like chlorophyll that have a colour .
af: wetenskaplikes het 'n term vir stowwe soos chlorofil wat 'n kleur het .

source: they call them pigments .
af: hulle noem sulke kleurstowwe pigmente .

source: there are other pigments in plants .
af: daar is ander pigmente in plante ook .

source: can you think of their colours ?
af: kan jy dink aan hul kleure ?

source: there are pigments in your body too !
af: daar is pigmente in jou liggaam ook !

source: where do you find them ?
af: waar kan ons dit sien ?

source: what do they do ?
af: wat doen dit ?

source: water the roots of a plant absorb water and nutrients from the soil .
af: water die wortels van 'n plant absorbeer water en minerale voedingstowwe uit die grond .

source: water is a solvent in all living things .
af: water is 'n oplosmiddel in alle lewende dinge .

source: dissolved substances are moved around the body to where they are needed .
af: opgeloste stowwe word deur die liggaam vervoer na waar dit benodig word .

source: just like you plants have veins for this movement .
af: net soos in ons liggame het plante ook are vir hierdie vervoer .

source: they move minerals from the roots upwards .
af: die are vervoer suikers vanaf die blare afwaarts .

source: they move sugars from the leaves downwards .
af: fotosintese kan slegs plaasvind in 'n wateroplossing .

source: photosynthesis can only happen in a water solution .
af: water is verder belangrik omdat dit ondersteuning verskaf sodat die plant regop kan bly .

source: water is also important because it provides support to the plant to keep it upright .
af: net soos jy het plante ook 'n skelet .

source: like you plants have skeletons .
af: plante gebruik water as 'n hidroskelet !

source: in the second term in matter and materials learners will do more on mixtures solutions and dissolving and this will therefore make sense .
af: in die tweede kwartaal sal leerders meer oor mengsels oplossings en die proses van oplossing in materie en materiale leer .

source: refer back to this section when you are doing solutions and discussing water as a solvent .
af: hierdie inligting sal dan meer sin maak .

source: carbon dioxide the plant absorbs or takes in carbon dioxide from the air through little holes .
af: koolstofdioksied die plant absorbeer koolstofdioksied uit die lug deur klein openinge wat huidmondjies genoem word .

source: these holes are found all over the plant mostly under the leaves .
af: hierdie openinge word oral oor die plant gevind maar meestal onder die blare .

source: these holes also allow other gasses and water to enter or leave the plant .
af: huidmondjies laat ook ander gasse en watertoe om die plant binne te kom of te verlaat .

source: they do the same job as your mouth and nose when you breath !
af: hulle het dieselfde funksie as jou mond en neus tydens asemhaling !

source: the same job as the pores in your skin when you sweat !
af: die sweetgaatjies in jou vel gee ook water af wanneer jy sweet !

source: soil the soil provides mineral nutrients and water for the plant that are necessary during photosynthesis .
af: grond die grond verskaf minerale voedingstowwe en water vir die plant wat noodsaaklik vir fotosintese is .

source: soil also provides anchorage to the plant otherwise the plant cannot stand up straight .
af: grond is ook nodig om die plant te anker anders sal dit nie regop kan staan nie .

source: the photosynthesis song. http www.youtube.com watch?v c1 uez5wx1o&amp;feature youtu.be
af: die fotosinteseliedjie. http www.youtube.com watch?v c1 uez5wx1o&amp;feature youtu.be

source: a really good website on photosynthesis http www.realtrees4kids.org sixeight letseat.htm
af: 'n goeie webblad oor fotosintese http www.realtrees4kids.org sixeight letseat.htm

source: photosynthesis video http www.youtube.com watch?v mppwmvtdjww
af: video oor fotosintese goo.gl ofp5v

source: plants use chlorophyll sunlight water and carbon dioxide to make food .
af: plante gebruik chlorofil sonlig water en koolstofdioksied om voedsel te vervaardig .

source: here is a simple illustration to show how this process occurs
af: hier is 'n eenvoudige illustrasie om te verduidelik hoe die proses plaasvind

source: starch is insoluble in water which is why plants store starch and not glucose which is soluble in water .
af: stysel is onoplosbaar in water en glukose is oplosbaar; daarom stoor plante koolhidrate as stysel en nie as glukose nie .

source: refer back to this section when doing soluble and insoluble substances in the second term .
af: keer terug na hierdie afdeling wanneer u oplosbare en onoplosbare stowwe in die tweede termyn behandel .

source: a game on growing plants http puzzling.caret.cam.ac.uk pregame.php?game 16&amp;phpsessid 65f1b591e2a1548e0f52d556373966ce
af: 'n speletjie oor groeiende plante! http puzzling.caret.cam.ac.uk pregame.php?game 16&amp;phpsessid 65f1b591e2a1548e0f52d556373966ce

source: prepare beforehand by collecting the different materials needed .
af: maak vooraf gereed deur die nodige materiale bymekaar te maak .

source: the characters need different colours to identify themselves as what they are possibly some t shirts that they can pull over their clothes or else a scarf or ribbon or coloured piece of paper to pin onto their front .
af: die karakters het verskillende kleure nodig om hulself te identifiseer moontlik t hemde wat hulle bo oor hulle klere kan aantrek of andersins 'n serp of strik of gekleurde stuk papier wat voor aangesteek kan word .

source: you will also need tin foil glitter and string for the roots .
af: u gaan ook tinfoelie benodig sowel as rys of blinkertjies en tou vir die wortels .

source: for the animals you can make masks out of paper plates with the eyes cut out and tied around the head with a piece of string .
af: vir die diere kan leerders maskers uit papierborde maak wat om die leerder se kop met 'n toutjie kan vasbind met gate vir o .

source: learners can draw animal faces on the front .
af: leerders kan dieregesigte op die voorkant teken .

source: the dramatisation when the dramatisation starts the glucose and oxygen actors sit quietly in small groups around the plants with their heads down not looking at the audience .
af: die dramatisering wanneer die dramatisering begin sit die glukose en suurstofakteurs stil in klein groepies rondom die plante met hulle koppe gebuig sonder om na die gehoor te kyk .

source: the narrator introduces the play and explains the different processes as these occur .
af: die verteller stel die toneel bekend en verduidelik die verskillende prosesse soos dit plaasvind .

source: the sun shines in the centre of the stage and can turn and or raise their arms to show the sunlight radiating from it .
af: die son skyn in die middel van die verhoog en hierdie leerder kan draai en of sy of haar arms oplig om te wys hoe die sonlig uit die son straal .

source: the plants stand away from the sun and the rainwater actors can 'water' them by gently throwing the rice or similar little objects over their heads .
af: die plante staan weg van die son en die renwaterakteurs maak hulle saggies nat deur rys of iets soortgelyks oor hulle koppe te strooi .

source: then sit down around the plants .
af: daarna gaan sit hulle rondom die plante .

source: the carbon dioxide actors run from the animals and circle the plants and then sit down around the plants .
af: die koolstofdioksied akteurs hardloop van die diere af en omsirkel die plante en sit dan rondom die plante .

source: now the oxygen and glucose actors rise and run around the plants and then run to the animals to show they are receiving oxygen and food .
af: nou staan die suurstof en glukose akteurs op en hardloop rondom die plante en daarna na die diere om te wys dat die diere suurstof en voedsel ontvang .

source: you might want to repeat this a few times to show that this cycle continues .
af: u kan dalk die dramatisering so 'n paar keer herhaal om te wys dat die siklus aanhou .

source: why do plants die when there is a drought ?
af: waarom gaan plante dood in tye van droogte ?

source: there are many processes which shut down without water photosynthesis being one of them .
af: daar is baie prosesse wat sonder water sal staak waarvan fotosintese een is .

source: plants cannot photosynthesise sunlight without water .
af: plante kan nie sonder water fotosinteer nie .

source: if they cannot photosynthesise they cannot create glucose to support life processes within the plant .
af: as hulle nie kan fotosinteer nie kan hulle nie glukose produseer om die lewensprosesse in die plant te ondersteun nie .

source: if the plant cannot support its own life processes it dies .
af: as die plant nie sy eie lewensprosesse kan ondersteun nie gaan dit dood .

source: the plant also loses its support from the water in the veins acting as a 'skeleton' .
af: die plant verloor ook die steun wat die water as hidroskelet gee en verlep .

source: soil was looked at in gr. 5 earth and beyond especially the particles of soil and which types of soil plants grow best in .
af: grond is behandel in gr. 5 in die planeet aarde en die ruimte spesifiek gronddeeltjies en watter soort grond die beste vir plante is .

source: however it would be useful to also emphasise soil in this section and have a discussion on what makes up soil namely organic and inorganic material water air rocks and sand .
af: dit sal egter goed wees om grond ook in hierdie gedeelte te benadruk en om 'n bespreking te h oor hoe grond saamgestel word naamlik van organiese en anorganiese materiaal water lug klippies en sand .

source: where possible bring examples of different soil types to class such as loam soil clay beach sand and get the learners to touch and feel the soil and explore what makes up soil .
af: waar moontlik bring voorbeelde van verskillende grondsoorte klas toe soos leemgrond kleigrond sanderige grond en laat leerders daaraan voel en ondersoek waaruit die grond bestaan .

source: photosynthesis is the process inside plants that changes the energy from the sun's light into a form of energy that animals can eat and use to carry out their life processes .
af: fotosintese is die proses in plante wat die energie van sonlig verander na 'n vorm van energie wat diere kan inneem en gebruik om hul eie lewensprosesse uit te voer .

source: plants changes the glucose into starch for example mealies mealies and maize flour rice rice flour and rice and wheat flour .
af: plante verander glukose in stysel byvoorbeeld in mielies mieliepitte en mieliemeel rys rysmeel en ryskorrels en koring koringkorrels en koringmeel .

source: plants then store this food in different parts of the plant that an animal will eat .
af: plante berg hierdie voedsel wat deur diere geet kan word in verskillende dele van die plant .

source: they can store it in their leaves stems or roots flowers fruits or seeds .
af: plante kan dit berg in hulle blare stingels of wortels blomme vrugte of sade .

source: look at the images below of different plant products .
af: kyk na die volgende voorstellings van verskillende plantprodukte .

source: for each image identify which part of that plant we eat for example when we eat an apple are we eating the leaf the stem the root the fruit or the seed of the plant? use the space below to draw a table for your answers .
af: identifiseer by elke voorstelling watter deel van die plant ons eet. byvoorbeeld wanneer ons 'n appel eet eet ons die stingel die wortel die vrug of die saad van die plant? gebruik die ruimte hieronder om 'n tabel te trek vir jou antwoorde .

source: cabbage
af: kool

source: flower
af: blom

source: tomatoes
af: tamaties

source: fruit
af: vrug

source: potatoes
af: aartappels

source: root
af: stingel

source: celery
af: seldery

source: carrots
af: geelwortels

source: sunflower seeds
af: sonneblomsade

source: seed
af: saad

source: lettuce
af: blaarslaai

source: leaf
af: blaar

source: sugar cane
af: suikerriet

source: hazelnuts
af: haselneute

source: mealies
af: mielies

source: bananas
af: piesangs

source: we know that plants make glucose a sugar but they store starch .
af: ons weet dat plante glukose 'n suiker maak maar hulle berg stysel .

source: let's now find out what the difference is .
af: kom ons vind uit wat die verskil is .

source: prepare beforehand prepare at least 10 different plant products in advance of this lesson and mark each item from 1 10 .
af: berei voor berei ten minste 10 verskillende plantprodukte vooraf vir hierdie les voor en merk elke item van 1 10 .

source: cut up fruit potato sweets into bite sized cubes .
af: sny verskillende vrugte aartappels lekkergoed in hapgrootte blokkies .

source: place flour cooked rice etc. into bowls .
af: sit meel gekookte rys ens. in bakkies .

source: use teaspoons to taste the flour cooked rice etc .
af: gebruik teelepels om die meel gekookte rys ens. te proe .

source: important before doing this activity find out if any of the learners have any allergies to these foods and if learners with diabetes are allowed to eat taste the fruit sweets .
af: belangrik voordat u hierdie aktiwiteit doen vind uit of enige van die leerders allergies vir enige van die kosse is en of leerders met diabetes toegelaat word om die vrugte lekkers te eet proe .

source: while learners are swapping with their blindfolded partners rearrange the foods with the numbers to ensure fairness .
af: terwyl leerders die blinddoeke omruil herrangskik die voedsels en die nommers om regverdigheid te verseker .

source: the aim of the test is not to establish the exact name of the fruits and foods but to establish that taste is not a suitable method to test for sugar or starch .
af: die doel van die toets is nie om die presiese name van die vrugte of voedsels vas te stel nie maar om vas te stel of smaak 'n goeie manier is om te toets vir suiker of stysel .

source: generally sugars are sweet and starches are not but not always .
af: gewoonlik is suikers soet en stysels nie maar nie in alle gevalle nie .

source: was it easy to distinguish between the sugar and the starch each time ?
af: was dit maklik om elke keer te onderskei tussen die suiker en stysel ?

source: which foods did you find difficult to classify ?
af: watter kosse was vir jou moeilik om te klassifiseer ?

source: what can you say about the difference between a starch and a sugar based on taste ?
af: wat merk jy op oor die verskil tussen 'n stysel en suiker op grond van die smaak ?

source: sugars are sweet starches are not .
af: suikers is soet stysels is nie .

source: using taste to check if a food is a sugar or a starch is not very reliable .
af: om smaak te gebruik om te bepaal of voedsel 'n suiker of 'n stysel is is nie baie betroubaar nie .

source: there is a special test that scientists use to see if a food product is a starch or not .
af: daar is 'n spesifieke toets wat deur wetenskaplikes gebruik word om te bepaal of 'n sekere voedselsoort stysel bevat of nie .

source: it is called the iodine starch test .
af: dit word die jodiumoplossing styseltoets genoem .

source: iodine solution is a special solution that is normally a brown liquid .
af: jodiumoplossing is 'n spesiale oplossing wat gewoonlik 'n bruin vloeistof is .

source: iodine is what we call an indicator .
af: jodiumoplossing is 'n indikator .

source: when iodine solution is dropped on starch the iodine and starch combine and produce a blue colour .
af: wanneer verdunde jodiumoplossing op stysel gedrup word kombineer die jodium en die stysel en vorm 'n donker blou swart kleur .

source: we use this to test whether there is starch in a food product .
af: hierdie toets word gebruik om te bepaal of daar stysel in 'n sekere voedselsoort is .

source: let's see how this works !
af: kom ons kyk hoe dit werk !

source: explanation for starch turning blue black when iodine is placed on it starch is composed of polymers of glucose .
af: verduideliking daarvoor dat stysel blou swart verkleur wanneer jodiumoplossing daarop geplaas word stysel bestaan uit polimere van glukose .

source: long linear chains are amylose .
af: lang linire glukosekettings word amilose genoem .

source: amylose coils into a structure resembling a tube with a hollow core .
af: amilose draai in 'n ruimtelike struktuur op wat soos 'n buisie met 'n hol kern lyk .

source: certain molecules including iodine can lodge inside the core .
af: sekere molekules insluitende jodiumoplossing kan in die kern pas .

source: the complex of iodine stuck inside the amylose coil produces a characteristic blue black colour .
af: die jodium wat in die amilosewinding vassit veroorsaak die kenmerkende blou swart kleur .

source: the starch itself is not altered .
af: die stysel self word nie verander nie .

source: nb this explanation is not necessary for learners but do say that the iodine reacts with the starch to form a blue black colour .
af: nb hierdie verduideliking is nie nodig vir die leerders nie noem slegs dat jodiumoplossing met stysel reageer om 'n blou swart kleur te vorm .

source: which test do you think is more accurate to test for starch the taste test or the iodine starch test ?
af: watter toets is volgens jou die akkuraatste om vir stysel te toets die proetoets of die jodiumoplossing styseltoets ?

source: did the animal products such as cheese and boiled egg contain starch ?
af: het die diereprodukte soos die kaas en gekookte eier stysel bevat ?

source: why do you think so ?
af: waarom dink jy so ?

source: animals do not produce or store starch .
af: diere produseer of stoor nie stysel nie .

source: starch is only stored in plant products .
af: stysel word slegs in plantprodukte gestoor .

source: animals do store carbohydrates but not in the form of starch .
af: diere stoor wel koolhidrate maar nie in die vorm van stysel nie .

source: only plants produce and store starch .
af: slegs plante produseer en stoor stysel .

source: animals store glucose in the form of glycogen .
af: diere stoor koolhidrate in die vorm van glikogeen .

source: all animals and plants need oxygen to live and carry out their life processes .
af: alle plante en diere benodig suurstof om te lewe en hulle lewensprosesse uit te voer .
